HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDam_regdef.h
/** \brief DAM Region Read Enable Register A   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DAM_RGNACCEN_RA_Bits B;       /**< \brief Bitfield access */
} Ifx_DAM_RGNACCEN_RA;

/** \brief DAM Region Read Enable Register B   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DAM_RGNACCEN_RB_Bits B;       /**< \brief Bitfield access */
} Ifx_DAM_RGNACCEN_RB;

/** \brief DAM Region Write Enable Register A   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DAM_RGN_ACCENA_Bits B;        /**< \brief Bitfield access */
} Ifx_DAM_RGN_ACCENA;

/** \brief DAM Region Write Enable Register B   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DAM_RGN_ACCENB_Bits B;        /**< \brief Bitfield access */
} Ifx_DAM_RGN_ACCENB;

/** \brief DAM Region Lower Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DAM_RGN_LA_Bits B;            /**< \brief Bitfield access */
} Ifx_DAM_RGN_LA;

/** \brief DAM Region Upper Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DAM_RGN_UA_Bits B;            /**< \brief Bitfield access */
} Ifx_DAM_RGN_UA;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Dam_RGN_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RGN object */
typedef volatile struct _Ifx_DAM_RGN
{
       Ifx_DAM_RGN_LA                      LA;                     /**< \brief 0, DAM Region Lower Address Register*/
       Ifx_DAM_RGN_UA                      UA;                     /**< \brief 4, DAM Region Upper Address Register*/
       Ifx_DAM_RGN_ACCENA                  ACCENA;                 /**< \brief 8, DAM Region Write Enable Register A*/
       Ifx_DAM_RGN_ACCENB                  ACCENB;                 /**< \brief C, DAM Region Write Enable Register B*/
} Ifx_DAM_RGN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Dam_RGNACCEN_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RGNACCEN object */
typedef volatile struct _Ifx_DAM_RGNACCEN
{
       Ifx_DAM_RGNACCEN_RA                 RA;                     /**< \brief 0, DAM Region Read Enable Register A*/
       Ifx_DAM_RGNACCEN_RB                 RB;                     /**< \brief 4, DAM Region Read Enable Register B*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_DAM_RGNACCEN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Dam_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief DAM object */
typedef volatile struct _Ifx_DAM
{
       Ifx_DAM_CLC                         CLC;                    /**< \brief 0, DAM Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_DAM_MODID                       MODID;                  /**< \brief 8, DAM Module ID Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_DAM_ACCEN0                      ACCEN0;                 /**< \brief 10, DAM Access Enable Register 0*/
       Ifx_DAM_ACCEN1                      ACCEN1;                 /**< \brief 14, DAM Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_18[8];         /**< \brief 18, \internal Reserved */
       Ifx_DAM_MEMCON                      MEMCON;                 /**< \brief 20, DAM Memory Control Register*/
       Ifx_UReg_8Bit                       reserved_24[44];        /**< \brief 24, \internal Reserved */
       Ifx_DAM_RGN                         RGN[8];                 /**< \brief 50, DAM Region Write Enable Register B*/
       Ifx_UReg_8Bit                       reserved_D0[8];         /**< \brief D0, \internal Reserved */
       Ifx_DAM_RGNACCEN                    RGNACCEN[8];            /**< \brief D8, */
       Ifx_UReg_8Bit                       reserved_158[32424];    /**< \brief 158, \internal Reserved */
} Ifx_DAM;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXDAM_REGDEF_H */
